In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
inputs = df.drop(['PassengerId','Survived','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis="columns")
# https://www.geeksforgeeks.org/how-to-drop-one-or-multiple-columns-in-pandas-dataframe/
target = df['Survived']
# df1 = df[['a','b']]

In [4]:
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [5]:
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

In [6]:

# inputs['Age'].describe()
inputs['Age'] = inputs['Age'].fillna(inputs['Age'].mean())

In [7]:
inputs

     Pclass     Sex        Age     Fare
0         3    male  22.000000   7.2500
1         1  female  38.000000  71.2833
2         3  female  26.000000   7.9250
3         1  female  35.000000  53.1000
4         3    male  35.000000   8.0500
..      ...     ...        ...      ...
886       2    male  27.000000  13.0000
887       1  female  19.000000  30.0000
888       3  female  29.699118  23.4500
889       1    male  26.000000  30.0000
890       3    male  32.000000   7.7500

[891 rows x 4 columns]

In [8]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le_Pclass = LabelEncoder()
le_Sex = LabelEncoder()
# le_Age = LabelEncoder()
le_Fare = LabelEncoder()

In [11]:
inputs['Pclass_n']=le_Pclass.fit_transform(inputs['Pclass'])
inputs['Sex_n']=le_Sex.fit_transform(inputs['Sex'])
# inputs['Age_n']=le_Pclass.fit_transform(inputs['Age']) 
# inputs['Fare_n']=LabelEncoder().fit_transform(inputs['Fare'])

In [12]:
inputs.head()

   Pclass     Sex   Age     Fare  Pclass_n  Sex_n
0       3    male  22.0   7.2500         2      1
1       1  female  38.0  71.2833         0      0
2       3  female  26.0   7.9250         2      0
3       1  female  35.0  53.1000         0      0
4       3    male  35.0   8.0500         2      1

In [13]:
# As age is a cotinouse random variable we will creat a group
# 0-12 = 0.Child
# 13-35 = 1.Younge
# 35-49 = 2.Middle-age 
# 50 + = 3.Old
max =inputs.Age.max()

inputs['Age_n'] = pd.cut(x = inputs['Age'],bins = [0,13,35,50,max],labels=[0,1,2,3],right=False)
inputs.Age_n.unique()

[1, 2, 3, 0]
Categories (4, int64): [0 < 1 < 2 < 3]

In [26]:
# As fair is divided in to catigorical values
inputs['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [14]:
inputs_n= inputs.drop(['Pclass','Sex','Age','Fare'],axis="columns")

In [15]:
inputs_n

     Pclass_n  Sex_n Age_n
0           2      1     1
1           0      0     2
2           2      0     1
3           0      0     1
4           2      1     1
..        ...    ...   ...
886         1      1     1
887         0      0     1
888         2      0     1
889         0      1     1
890         2      1     1

[891 rows x 3 columns]

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
X_train,X_test,y_train,y_test = train_test_split(inputs_n,target,test_size = 0.3,random_state = 10 )

In [18]:
len(X_train)

623

In [19]:
len(X_test)

268

In [20]:
from sklearn import tree

In [21]:
model = tree.DecisionTreeClassifier()

In [22]:
# model

In [23]:
model.fit(X_test,y_test) ###

DecisionTreeClassifier()

In [24]:
model.score(X_train,y_train)

0.7768860353130016

In [25]:
model.predict([[2,1,28,10]])

ValueError: Number of features of the model must match the input. Model n_features is 3 and input n_features is 4

In [ ]:
model.predict(inputs_n)

In [ ]:
from sklearn.metrics import confusion_matrix
results = confusion_matrix(target, model.predict(inputs_n))

In [ ]:
print(results)

In [ ]:
from sklearn.metrics import accuracy_score 
print('Accuracy Score :',accuracy_score(target, model.predict(inputs_n)) )